from datetime import datetime

# მომხმარებლისგან დაბადების წლის მიღება
birth_year = int(input("შეიყვანეთ თქვენი დაბადების წელი: "))
current_year = datetime.now().year

# წლოვანების გამოთვლა
age = current_year - birth_year
print("თქვენი წლოვანება არის: {age} წელი.")

================================================

# მომხმარებლისგან სიგრძისა და სიგანის მიღება
length = float(input("შეიყვანეთ ოთკუთხედის სიგრძე: "))
width = float(input("შეიყვანეთ ოთკუთხედის სიგანე: "))

# ფართობის და პერიმეტრის გამოთვლა
area = length * width
perimeter = 2 * (length + width)

print("ოთკუთხედის ფართობია: {area} კვ. მეტრი")
print("ოთკუთხედის პერიმეტრი არის: {perimeter} მეტრი")

=================================================================

# მომხმარებლისგან მანძილის მიღება
distance_km = float(input("შეიყვანეთ თქვენი სახლიდან სკოლამდე მანძილი (15): "))

# მანძილის გარდატეხვა სხვადასხვა ერთეულში
distance_m = distance_km * 1000
distance_cm = distance_km * 100000
distance_mm = distance_km * 1000000

print("მანძილი მეტრებში: {distance_m} მ")
print("მანძილი სანტიმეტრებში: {distance_cm} სმ")
print("მანძილი მილიმეტრებში: {distance_mm} მმ")

==================================================

# მომხმარებლისგან მონაცემების მიღება
first_name = input("შეიყვანეთ თქვენი სახელი: ")
last_name = input("შეიყვანეთ თქვენი გვარი: ")
parent_first_name = input("შეიყვანეთ მშობლების სახელი: ")
parent_last_name = input("შეიყვანეთ მშობლების გვარი: ")
favorite_color = input("შეიყვანეთ საყვარელი ფერი: ")
favorite_car = input("შეიყვანეთ საყვარელი მანქანა: ")
hobby1 = input("შეიყვანეთ საყვარელი ჰობი 1: ")
hobby2 = input("შეიყვანეთ საყვარელი ჰობი 2: ")
hobby3 = input("შეიყვანეთ საყვარელი ჰობი 3: ")

# ყველა მონაცემის დაბეჭდვა ერთ წინადადებაში
print("{first_name} {last_name}, {parent_first_name} {parent_last_name}-ის შვილი, უყვარს {favorite_color} ფერი, {favorite_car} მანქანა და მისი საყვარელი ჰობიებია: {hobby1}, {hobby2}, {hobby3}.")

=============================================================================================


# მომხმარებლისგან ორნიშნა რიცხვის მიღება
number = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

# ციფრების ამოღება და ჯამის გამოთვლა
digit1 = number // 10  # პირველი ციფრი
digit2 = number % 10   # მეორე ციფრი
digit_sum = digit1 + digit2

print("ციფრების ჯამი არის: {digit_sum}")



